src/VirtualClient/VirtualClient.Actions.UnitTests/Examples/Memtier/RedisResults_2.txt
4         Threads
4         Connections per thread
60        Seconds


ALL STATS
============================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p90 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec 
------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        31066.57          ---          ---        25.70197        26.23900        37.88700        41.98300        51.71100        62.46300      2180.96 
Gets        31066.57       248.21     30818.37        25.70197        26.23900        37.88700        41.98300        51.71100        62.46300      1006.06 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---          --- 
Totals      62133.15       248.21     30818.37        25.70197        26.23900        37.88700        41.98300        51.71100        62.46300      3187.02 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.543        0.000
SET      10.239        5.000
SET      13.695       10.000
SET      14.783       15.000
SET      15.999       20.000
SET      16.511       25.000
SET      19.967       30.000
SET      21.375       35.000
SET      23.935       40.000
SET      24.191       45.000
SET      26.239       50.000
SET      27.775       52.500
SET      28.031       55.000
SET      28.031       57.500
SET      28.415       60.000
SET      29.823       62.500
SET      30.463       65.000
SET      31.871       67.500
SET      31.999       70.000
SET      31.999       72.500
SET      31.999       75.000
SET      31.999       76.250
SET      31.999       77.500
SET      32.127       78.750
SET      32.511       80.000
SET      33.535       81.250
SET      34.047       82.500
SET      35.327       83.750
SET      36.095       85.000
SET      36.095       86.250
SET      36.351       87.500
SET      36.607       88.125
SET      37.375       88.750
SET      37.887       89.375
SET      37.887       90.000
SET      38.143       90.625
SET      38.911       91.250
SET      39.935       91.875
SET      40.191       92.500
SET      40.191       93.125
SET      41.471       93.750
SET      41.727       94.062
SET      41.727       94.375
SET      41.983       94.688
SET      41.983       95.000
SET      41.983       95.312
SET      42.239       95.625
SET      43.263       95.938
SET      43.775       96.250
SET      44.031       96.562
SET      45.055       96.875
SET      45.567       97.031
SET      45.823       97.188
SET      46.079       97.344
SET      46.079       97.500
SET      47.103       97.656
SET      47.359       97.812
SET      48.127       97.969
SET      48.127       98.125
SET      49.151       98.281
SET      49.663       98.438
SET      49.919       98.516
SET      49.919       98.594
SET      50.175       98.672
SET      50.431       98.750
SET      50.943       98.828
SET      51.199       98.906
SET      51.711       98.984
SET      51.967       99.062
SET      52.223       99.141
SET      52.479       99.219
SET      52.991       99.258
SET      53.247       99.297
SET      53.503       99.336
SET      53.759       99.375
SET      53.759       99.414
SET      54.015       99.453
SET      54.271       99.492
SET      55.295       99.531
SET      55.807       99.570
SET      56.063       99.609
SET      56.319       99.629
SET      56.319       99.648
SET      56.319       99.668
SET      56.575       99.688
SET      56.831       99.707
SET      57.599       99.727
SET      57.599       99.746
SET      57.855       99.766
SET      57.855       99.785
SET      58.367       99.805
SET      58.623       99.814
SET      58.879       99.824
SET      59.647       99.834
SET      59.647       99.844
SET      60.415       99.854
SET      61.183       99.863
SET      61.439       99.873
SET      61.439       99.883
SET      62.207       99.893
SET      62.463       99.902
SET      62.463       99.907
SET      63.487       99.912
SET      63.999       99.917
SET      64.767       99.922
SET      64.767       99.927
SET      64.767       99.932
SET      65.279       99.937
SET      66.559       99.941
SET      66.559       99.946
SET      67.071       99.951
SET      68.095       99.954
SET      68.607       99.956
SET      69.631       99.958
SET      70.143       99.961
SET      70.143       99.963
SET      70.655       99.966
SET      72.191       99.968
SET      72.191       99.971
SET      72.191       99.973
SET      72.191       99.976
SET      72.191       99.977
SET      72.191       99.978
SET      73.727       99.979
SET      73.727       99.980
SET      74.239       99.982
SET      74.239       99.983
SET      74.751       99.984
SET      74.751       99.985
SET      74.751       99.987
SET      75.263       99.988
SET      75.263       99.988
SET      75.263       99.989
SET      90.111       99.990
SET      90.111       99.990
SET      90.111       99.991
SET      90.111       99.991
SET      91.135       99.992
SET      91.135       99.993
SET      91.135       99.993
SET      91.135       99.994
SET      91.135       99.994
SET      91.135       99.995
SET      91.647       99.995
SET      91.647      100.000
---
GET       0.543        0.000
GET      10.239        5.000
GET      13.695       10.000
GET      14.783       15.000
GET      15.999       20.000
GET      16.511       25.000
GET      19.967       30.000
GET      21.375       35.000
GET      23.935       40.000
GET      24.191       45.000
GET      26.239       50.000
GET      27.775       52.500
GET      28.031       55.000
GET      28.031       57.500
GET      28.415       60.000
GET      29.823       62.500
GET      30.463       65.000
GET      31.871       67.500
GET      31.999       70.000
GET      31.999       72.500
GET      31.999       75.000
GET      31.999       76.250
GET      31.999       77.500
GET      32.127       78.750
GET      32.511       80.000
GET      33.535       81.250
GET      34.047       82.500
GET      35.327       83.750
GET      36.095       85.000
GET      36.095       86.250
GET      36.351       87.500
GET      36.607       88.125
GET      37.375       88.750
GET      37.887       89.375
GET      37.887       90.000
GET      38.143       90.625
GET      38.911       91.250
GET      39.935       91.875
GET      40.191       92.500
GET      40.191       93.125
GET      41.471       93.750
GET      41.727       94.062
GET      41.727       94.375
GET      41.983       94.688
GET      41.983       95.000
GET      41.983       95.312
GET      42.239       95.625
GET      43.263       95.938
GET      43.775       96.250
GET      44.031       96.562
GET      45.055       96.875
GET      45.567       97.031
GET      45.823       97.188
GET      46.079       97.344
GET      46.079       97.500
GET      47.103       97.656
GET      47.359       97.812
GET      48.127       97.969
GET      48.127       98.125
GET      49.151       98.281
GET      49.663       98.438
GET      49.919       98.516
GET      49.919       98.594
GET      50.175       98.672
GET      50.431       98.750
GET      50.943       98.828
GET      51.199       98.906
GET      51.711       98.984
GET      51.967       99.062
GET      52.223       99.141
GET      52.479       99.219
GET      52.991       99.258
GET      53.247       99.297
GET      53.503       99.336
GET      53.759       99.375
GET      53.759       99.414
GET      54.015       99.453
GET      54.271       99.492
GET      55.295       99.531
GET      55.807       99.570
GET      56.063       99.609
GET      56.319       99.629
GET      56.319       99.648
GET      56.319       99.668
GET      56.575       99.688
GET      56.831       99.707
GET      57.599       99.727
GET      57.599       99.746
GET      57.855       99.766
GET      57.855       99.785
GET      58.367       99.805
GET      58.623       99.814
GET      58.879       99.824
GET      59.647       99.834
GET      59.647       99.844
GET      60.415       99.854
GET      61.183       99.863
GET      61.439       99.873
GET      61.439       99.883
GET      62.207       99.893
GET      62.463       99.902
GET      62.463       99.907
GET      63.487       99.912
GET      63.999       99.917
GET      64.767       99.922
GET      64.767       99.927
GET      64.767       99.932
GET      65.279       99.937
GET      66.559       99.941
GET      66.559       99.946
GET      67.071       99.951
GET      68.095       99.954
GET      68.607       99.956
GET      69.631       99.958
GET      70.143       99.961
GET      70.143       99.963
GET      70.655       99.966
GET      72.191       99.968
GET      72.191       99.971
GET      72.191       99.973
GET      72.191       99.976
GET      72.191       99.977
GET      72.191       99.978
GET      73.727       99.979
GET      73.727       99.980
GET      74.239       99.982
GET      74.239       99.983
GET      74.751       99.984
GET      74.751       99.985
GET      74.751       99.987
GET      75.263       99.988
GET      75.263       99.988
GET      75.263       99.989
GET      90.111       99.990
GET      90.111       99.990
GET      90.111       99.991
GET      90.111       99.991
GET      91.135       99.992
GET      91.135       99.993
GET      91.135       99.993
GET      91.135       99.994
GET      91.135       99.994
GET      91.135       99.995
GET      91.647       99.995
GET      91.647      100.000
---
WAIT      0.000      100.000